app/views/users/show.html.erb

  <%if @user == current_user%>
    <h1> Your Experiences <span class="count"> (<%=current_user.experiences.count%>)<span> </h1>
---
SELECT "experiences".* FROM "experiences" WHERE "experiences"."user_id" = ?  [["user_id", 3]]
SELECT COUNT(*) FROM "experiences" WHERE "experiences"."user_id" = ?  [["user_id", 2]]

  <div class="all-experiences">
    <%@user.experiences.all.sort{|a,b| b.id <=> a.id}.each do |experience|%>
---
SELECT "experiences".* FROM "experiences" WHERE "experiences"."user_id" = ?  [["user_id", 2]]