app/views/experiences/index.html.erb

  <div class="all-experiences">
    <%Experience.all.sort{|a,b| b.id <=> a.id}.each do |experience|%>
---
SELECT "experiences".* FROM "experiences"

          <%=link_to "/users/#{experience.user_id}" do%>
            <h4><%=experience.user.first_name.capitalize%></h4>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]