app/views/experiences/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  <div class="right">
    <h4><%=@experience.user.first_name%></h4>