app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def current_user
    if logged_in?
      User.find(session[:user_id])