app/controllers/experiences_controller.rb

  def create
    @experience = Experience.new(experience_params)
    @experience.user=User.find(1)
    if @experience.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "experiences" ("name", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["name", "helping my mom"], ["description", ""], ["created_at", "2018-11-01 03:28:56.048832"], ["updated_at", "2018-11-01 03:28:56.048832"], ["user_id", 1]]

  def show
    @experience = Experience.find_by(id: params[:id])
---
SELECT  "experiences".* FROM "experiences" WHERE "experiences"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit
    @experience = Experience.find_by(id: params[:id])
---
SELECT  "experiences".* FROM "experiences" WHERE "experiences"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]

  def update
    @experience = Experience.find(params[:id])
    @experience.update(experience_params)
---
SELECT  "experiences".* FROM "experiences" WHERE "experiences"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
UPDATE "experiences" SET "name" = ?, "updated_at" = ? WHERE "experiences"."id" = ?  [["name", "attaining a USPTR accreditation in tennis, after starting the sport at age 25"], ["updated_at", "2018-11-04 02:21:00.114457"], ["id", 10]]