app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "bennyhudsonhung@gmail.com"], ["LIMIT", 1]]
---
  def create
    if params[:user][:email].blank? || params[:user][:password].blank?
      redirect_to '/login'
    else
      if @user=User.find_by(email: params[:user][:email])