app/controllers/users_controller.rb

INSERT INTO "users" ("first_name", "last_name", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
    def create
      @user = User.create(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "avatar" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["avatar", "14202742_10154018893107956_6783552675387624398_n.jpg"], ["updated_at", "2018-11-04 05:14:09.546046"], ["id", 5]]
---
    def update
      @user=User.find(params[:id])
      if @user.update_attributes(user_params)