app/models/experience.rb

SELECT COUNT(*) FROM "experiences"
---
  def self.total_experiences
    Experience.all.count